[{"Id":"3717879a-1029-487e-a2a4-82d6cbb3153e","Title":"A run through a .NET runtime - How does my app actually work?","Abstract":"There are a lot of runtimes for .NET, and each one comes with its own tools and target use-cases. If you're maintaining legacy systems on Windows you might be using the .NET Framework. If you're building apps for the cloud you might be using .NET Core. If you're building games or mobile apps you might be using Mono. In .NET 5, the best of each of these runtimes will be consolidated into a single platform, based on .NET Core.\r\n\r\nIn this practical session, we're going to take a terminal window and a suite of tools, then roll up our sleeves to pick apart pieces of CoreCLR, the .NET Core runtime, and its cousin CoreRT. We'll see how our apps are transformed along their journey from C# source into executable code. We'll learn about just-in-time compilation, ahead-of-time compilation, cross-platform compilation, reflection, dynamic code generation and debugging. We'll build an understanding of what the heart of the platform we build on does with our code so that we can be more confident when deploying it. In the end we'll have some idea of where .NET has come from and where it's going.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend Development","Programming Languages","Tooling"],"Presenters":[{"Id":"a7a61f6b-3796-4241-87c0-4b992ddcf964","Name":"Ashley Mannix","Tagline":"Engineer at Datalust","Bio":"Ashley is an engineer at Datalust and member of the Rust programming language's Libs team, focusing on the sustainability of the wider ecosystem.","ProfilePhotoUrl":"https://sessionize.com/image?f=aa7021b360db69ac187448d1722bda4a,400,400,1,0,03-068c-44eb-bd23-3cdd17fc725a.19762168-1e25-4bdd-accd-310c4f029368.png","TwitterHandle":"KodrAus","WebsiteUrl":"https://kodraus.github.io"}]},{"Id":"470a7ebe-643f-4112-be34-7cfeccd576dc","Title":"CSS Grid - What is this Magic?!","Abstract":"We’ve all heard a lot in the last year about a new advancement in the world of CSS, called CSS Grid. Starting off at whispers, we’re now starting to hear it as a deafening roar as more and more developers write about it, talk about it, share it and start using it. In the world of front end, I see it everywhere I turn and am excited as I start to use it in my own projects.\r\n\r\nBut what does this new CSS specification mean for software developers, and why should you care about it? In the world of tech today, we can do so many amazing things and use whatever language we choose across a wide range of devices and platforms. Whether it’s the advent of React and React Native, or frameworks like Electron, it’s easier than ever to build one app that works on multiple platforms with the language we know and work with best. The ability to do this also expands to styling apps on any platform using CSS, and therefore being able to utilise the magical thing that is\r\nCSS Grid.\r\n\r\nThe reason CSS Grid is gaining so much attention, is because it’s a game changer for front end and layouts. With a few simple lines of code, we can now create imaginative, dynamic, responsive layouts (yep, I know that’s a lot of buzz words). While a lot of people are calling this the new ‘table layout’, grid gives us so much more, with the ability to spread cells across columns and rows to whatever size you choose, dictate which direction new items flow, allow cells to move around to fit in place and even tell certain cells exactly where they need to sit.\r\n\r\nWhile there is so much to worry about when developing an app, CSS Grid means that you can worry less about building the layout on the front end, and more about making sure the back end works well. Let me show you how the magic works.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Frontend Development","Web"],"Presenters":[{"Id":"2e76f166-4939-46ad-bd70-cffd5a47dad9","Name":"Amy Kapernick","Tagline":"Front End Jedi, Evangelist and Dog Lover","Bio":"Amy is a freelance developer, starting her own business, working with other freelancers and learning everything she can about the web. She’s been a freelancer on the side for 4 years, and most recently worked at an agency in Subiaco.\r\nAmy also spends her time helping out as a co-organiser for Fenders (a community group of front-end developers in Perth), other community events (such as the JuniorDev Meetup and Perth Web Girls) and works as an evangelist for YOW! Conference. She blogs in her spare time (about tech, the web and life), and volunteers as a reviewer for the Fringe World Festival in Perth.","ProfilePhotoUrl":"https://sessionize.com/image?f=0db4ea20d56b0f19a4f5801f1adaa8ed,400,400,1,0,5c-ed26-4dc6-8612-0f18abdfd9f5.e5b882c9-8f56-4eb9-a20d-7c6723ab8bf0.jpg","TwitterHandle":"amys_kapers","WebsiteUrl":"https://amygoestoperth.com.au"}]},{"Id":"02c5d1fa-29ee-4d04-b785-f3c66758d8d4","Title":"GraphQL, gRPC or REST? Resolving the API Developer's Dilemma","Abstract":"GraphQL, gRPC, REST and WebHooks are among a bewildering array of technologies and architectural styles that are available to API developers today. Presented with such myriad options, how can we be confident of making an appropriate decision for the problem at hand? In search of guidance, developers often turn to online communities. This can exacerbate the problem as discussions about API styles often descend into statements about the superiority of one approach over another being presented as universal truths. Such comments invariably earn emotive rebuttals that also lack sufficient nuance. The result of such exchanges is increased confusion and uncertainty. Join me on a tour of these API styles where we will cut through this noise, demonstrate where each style shines (plus where they don't!) and ultimately resolve this dilemma of choice.\r\n\r\nIn this session we'll take an in-depth look at API design; the best practices that have evolved; the game changing supporting technologies that are now available including HTTP/2; and most importantly what you need to do to deliver a world class developer experience:\r\n\r\n- How to determine the suitability of an API style for your application context. Don't be a victim of technology hype!\r\n- What is required to support graceful evolution of the API contract including the potential implications of both Hyrum's Law and the Law of Implicit Interfaces\r\n- Understand the supporting toolchains and technologies that dovetail with each API style.\r\n- The importance of treating your API as a product with an unwavering focus on improving the ease of consumption for your clients.\r\n\r\nBy the end of the session, you will not only understand the concepts underpinning these various API styles but also have the knowledge to put them into practice. If you want to take to your API design expertise to the next level, then this is the session for you. See you there!","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend Development","APIs","Architecture"],"Presenters":[{"Id":"e8614007-448f-460d-82bd-223021f51f3b","Name":"Rob Crowley","Tagline":"Principal Consultant @ Readify","Bio":"Rob is a software consultant, developer and team lead with a passion for delivering systems that perform at scale. Rob has over 15 years of experience building distributed systems on the web stack and has read more RFCs than he cares to admit. Rob is an active member of the Perth IT community and regularly shares his ideas at various Meetups and conferences around Australia and internationally. He is also a co-organiser of DDD Perth, the largest IT conference in Western Australia.","ProfilePhotoUrl":"https://sessionize.com/image?f=786e3fbb5d5ef29d082c5061b05ec7e8,400,400,1,0,57-1142-4eb0-9b08-719c3d875bf8.b26f935d-593e-4798-a41b-d1453e1e0b85.png","TwitterHandle":"robdcrowley","WebsiteUrl":"https://www.linkedin.com/in/robdcrowley"}]},{"Id":"abfaae45-5d6d-4226-a937-f49fe4e3cb87","Title":"It's 2019, time to talk about web components (again)","Abstract":"Even though web components have been around for while they have struggled to get traction. In part this was due to lack of browser support and the raise of framework/libraries such as Angular and React, et.al. But the times are a changing.\r\n\r\nOver the last year there has been a resurgence in interest around web components in part driven by improved browser support and a growing interest in developing framework agnostic components. Given this it seems like a good time to reassess web components.\r\n\r\nIn this talk we will answer the questions \"what are web components and why should I care?\", \"how do I create a web component and what tools do I need?\" and finally \"what are the pros, cons and best practices for web components?\".\r\n","Format":"45 mins","Level":"Mostly intermediate","Tags":["Frontend Development","Web"],"Presenters":[{"Id":"63272161-08f9-4041-9ad9-a991ae2a2c19","Name":"william tulloch","Tagline":"Principal Consultant - Readify","Bio":" William has been involved in software development for over 20 years and is currently working as a Principal Consultant for Readify.\r\nHis interests range from database development to UX design focusing on web development for the last couple of years. William has been active in the developer community including speaking at various conferences within Australia.\r\n","ProfilePhotoUrl":"https://sessionize.com/image?f=299021e67e7f9aa5d7348028c36b8187,400,400,1,0,54-21ae-4bf5-8ca3-1f6e4e5495d4.ee9d1727-9ca2-4981-9133-84a3c90b03b7.jpg","TwitterHandle":"wtulloch","WebsiteUrl":"http://www.williamtulloch.com"}]},{"Id":"421b767a-5145-49b5-8d0d-2735f11b2237","Title":"Making gaming accessible: Leveraging cloud services to build games everyone can play","Abstract":"Making games is great! Making games everyone can play is even better. In this live demo we explore how independent developers and hobbyists can implement accessibility features such as Text-To-Speech on a budget by leveraging Azure Cognitive Services.","Format":"45 mins","Level":"No experience necessary","Tags":["Design and UX","Coding","Azure"],"Presenters":[{"Id":"abc6d9e1-31f7-401b-81ca-514a313a990b","Name":"Scott Cabot","Tagline":"Graduate Solution Developer at Head Full of Heart","Bio":"Scott is currently a Full Stack Developer at Head Full of Heart. His previous experiences come from the game development industry, including working on a locally made mobile racing game and self-publishing a children’s educational game. Scott also ran his own business creating Serious Games. Serious games are products that have explicit benefits other than just entertainment, this can include mental and physical rehabilitation or education to name a few examples. As an advocate for accessibility in games Scott likes to explore cost effective ways to help you connect with a wide and diverse audience.","ProfilePhotoUrl":"https://sessionize.com/image?f=bdcb1b2c33ed6618845c53bbdadbd032,400,400,1,0,2e-f2ed-458f-ac0b-682f665c6301.eb896a7e-1a1d-4f77-b174-88cd1bcdb51c.png","TwitterHandle":"thescottcabs","WebsiteUrl":"https://medium.com/@thescottcabs"}]},{"Id":"32f930bd-76b7-4f53-8536-e573fb2e2e9e","Title":"Making React Apps Accessible: It's easier than you think","Abstract":"Javascript frameworks get a bad rap when it comes to accessibility. But is it the frameworks creating the barriers, or us as the developers?\r\n\r\nFollow me on a journey through div soup, past the lost focus and under the unchanged titles. Find out: is there actually anything in React preventing us from building accessible web apps? You'll get an overview of fundamental issues, how to address them, and how to ensure your website is accessible and inclusive to all.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Frontend Development","Web","Coding"],"Presenters":[{"Id":"246e9201-8fa0-47df-a77b-9947f3a09d72","Name":"Jess Budd","Tagline":"UI Developer, Web Accessibility Consultant, Digital Producer","Bio":"Jess Budd is an experienced UI developer and web accessibility consultant, working as a Digital Producer at Australia's second largest not-for-profit health fund. She is co-organiser of a local meetup for front-end developers and is often found volunteering her time mentoring women learning to code. She’s known for her love of cheese, but is also crazy about UX design, technology and futurism.","ProfilePhotoUrl":"https://sessionize.com/image?f=3f6c261526e7518071112153a8fb7d4e,400,400,1,0,a5-a987-4e6d-988e-0f2d89d317ab.95c45af0-ed7b-4732-ab8f-da18510aa6a6.jpg","TwitterHandle":"jessbudd4","WebsiteUrl":"https://jessbudd.com/"}]},{"Id":"d8828115-c4e0-4a84-8149-33140121efbc","Title":"Micro Frontends: Breaking up your Monolithic User Interface","Abstract":"In this session I'll cover the concept of Micro Frontends, and how we've applied this principle to help increase developer productivity and team autonomy while decomposing a monolithic application.\r\n\r\nI'll cover the advantages and disadvantages of this approach, and share the knowledge that we've gained during our transition into Micro Frontend architecture.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Frontend Development","Web","Architecture"],"Presenters":[{"Id":"f845477d-1bd7-4838-a9d8-6a3b809c6f2f","Name":"Josh Parnham","Tagline":"Software Developer at Xero","Bio":"Josh is a passionate Software Developer at Xero and a co-organiser of the JuniorDev meetup group.","ProfilePhotoUrl":"https://sessionize.com/image?f=f77faffe98053fe9b1733fa5fc2ef5a0,400,400,1,0,9f-ea50-4dae-93d8-76ede86f0415.e55ade5b-4a36-4f00-a6de-fe7a7e7a1a12.jpg","TwitterHandle":"http://twitter.com/joshparnham","WebsiteUrl":"http://linkedin.com/in/joshparnham/"}]},{"Id":"8dd7db0c-0090-4fb1-a182-8b9758210dd5","Title":"Modern Authentication 101","Abstract":"There has never been more emphasis in security than in the modern environment of distributed computing and increased sharing of data. Our data does not sit inside silos consumed by one application anymore. In this context the modern distributed applications need to securely access protected resources without having to share passwords. We need scalable solutions that work with things like single page applications. We will dive in and explore terms like `OAuth`, `OpenIdConnect` and `JWT` and how they relate to authentication and authorisation. This presentation hopes to give you a good understanding of what, where and how to get started with the modern approaches to authentication.","Format":"45 mins","Level":"No experience necessary","Tags":["Backend Development","Security","Cloud"],"Presenters":[{"Id":"c3931d87-c471-4b50-b03c-ac9d8ae91ad6","Name":"Dasith Wijesiriwardena","Tagline":"Senior Developer - Readify","Bio":"Full stack .NET dev with distributed systems focus. Keen problem solver and improving cricketer. Currently working at Readify.","ProfilePhotoUrl":"https://sessionize.com/image?f=0d744e5178230ed39b53bf0660a5cb0c,400,400,1,0,a7-1147-48db-84b8-6be42af9a616.cad8498c-4e67-49eb-a3d0-9885c8245f5b.jpg","TwitterHandle":"dasiths","WebsiteUrl":"https://dasith.me"}]},{"Id":"40dad6e1-e0bf-4766-aaa9-c10e72d80c16","Title":"On the Origin of CSS: Evolution of a Stylesheet","Abstract":"Since its inception, Cascading Stylesheets have been helping us turn our simple documents into works of art (and sometimes, even beautiful User Experiences). Layouts have evolved from structured-documents, to column layouts using tables and complex responsive designs via CSS grid. Along the way we’ve picked up quirks and oddities (box-sizing, gah!). \r\n\r\nLet’s have a look at some of the evolutionary steps CSS has taken during its long journey from microbe to beast. From straight-up document to myspace extravagance… from noughties e-commerce site to css-in-js-in-module-in-shadow-root-component web app.\r\n\r\nWe'll look at where CSS has come from, where it is, and where it's going - with exciting developments such as the Houdini API. We might even design a geocities site or two… stay tuned.","Format":"45 mins","Level":"No experience necessary","Tags":["Frontend Development","Web","UX"],"Presenters":[{"Id":"c15ff5a7-69a8-4082-8ca4-caca6faa8117","Name":"Dan Harris","Tagline":"Upper-middle-stack Engineer 🥞 @ HappyCo","Bio":"Dan is a Frontend Engineer at Happyco. He has a wide range of experience building delightful frontend experiences using CSS, HTML, Whatever-framework-of-the-day, grit and pure determination. At night, he moonlights as a community organiser for Adelaides Frontend Dev Meetup + Heaps Good Dev.\r\nHe enjoys long walks along the beach and dad jokes.... oh, and Coffee. Lots of Coffee.","ProfilePhotoUrl":"https://sessionize.com/image?f=0a36e76972b94b97c3cebfe7f76cbe78,400,400,1,0,fe-9498-4861-a0c5-a5a12187d485.3c4a6831-2d64-4dc2-92ec-b09dc67d8c1a.jpg","TwitterHandle":"danharris_io","WebsiteUrl":"https://danharris.io"}]},{"Id":"cecb2a6a-ef38-4c94-bc7d-5a9da95e0e6b","Title":"Rise of the Machines – Technology in Humanity","Abstract":"When did we as a species decide it would be amazing to insert technology into or onto... well... ourselves? Have we really - collectively or individually - thought this through? \r\n\r\nWhat has history taught us about bionic enhancements and where does the future take us? Are we really on the cusp of having superhero mechanical arms and enhanced intelligence? Or is the rise of the machines only a dystopian dream?\r\n\r\nLars will take us on a journey filled with robots, artificial intelligence, cyborgs, nano-technology and much more - to find out how these technologies will impact us in the not-so-distant future, and how we can get in front of them to influence that impact today.","Format":"45 mins","Level":"No experience necessary","Tags":["Design and UX","Machine Learning","UX"],"Presenters":[{"Id":"a726f0c5-f890-45b0-8c81-d86dd4a1e1d0","Name":"Lars Klint","Tagline":"Azure Technical Instructor - A Cloud Guru","Bio":"Lars is an author, trainer, Microsoft MVP, community leader, aspiring Microsoft Azure expert and part time classic car collector. He is heavily involved in the space of cloud computing services, especially Azure, loves HoloLens and mixed reality, and is a published author, solution architect and writer for numerous publications. He has been a part of the software development community for the past 20 years and co-organises the DDD Melbourne community conference, organises developer events with Microsoft, and also runs a part time car restoration business. He has spoken at numerous technical events around the world and is an expert in Australian Outback Internet.","ProfilePhotoUrl":"https://sessionize.com/image?f=79d1884e1914c20dbf4f20f20277d7c8,400,400,1,0,78-6176-4ff4-b151-c717fa5daf0c.38e1c362-9839-4818-9694-eca529361b1a.jpg","TwitterHandle":"larsklint","WebsiteUrl":"https://larsklint.com"}]},{"Id":"7b2871f4-fddd-45d6-9156-18ae984bad1f","Title":"Shifting Left: DevSecOps as an Approach to Building Secure Products","Abstract":"In order to build secure products, we need to begin security testing from the very beginning of the development lifecycle, and test continuously throughout the product's lifespan. Relying only on security testing just prior to a software release increases the likelihood of costly, systemic security flaws, and relies too heavily on the skill of a given penetration tester or code reviewer to find all vulnerabilities in a product before it is released into production.\r\n\r\nIn this talk, Jakob speaks about how you can leverage DevOps tooling and processes to integrate security testing into your pipeline to apply multiple layers of checks and balances to each line of code from commit to production.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend Development","DevOps","Security"],"Presenters":[{"Id":"bb9aed80-25a8-4a9a-84c9-3213fd039d32","Name":"Jakob Pennington","Tagline":"Application Security Specialist at Taptu","Bio":"Jakob (@JakobTheDev) is an Application Security Specialist at Taptu (@TaptuIT) where he works as a software developer, penetration tester and DevOps engineer. Jakob's passion lies where development meets cybersecurity and he tries to bridge these domains to help developers build more secure products.\r\n\r\nJakob is an active member in the Adelaide tech community, as a co-organiser of the SecTalks Adelaide and Heaps Good Dev meetups. He has spoken at a variety of meetups and presents at universities to share his experiences as a recent graduate.","ProfilePhotoUrl":"https://sessionize.com/image?f=afc94e433d5c9f1ef018ef1018994b7b,400,400,1,0,cb655aaf-02ba-4b00-b0ce-89a77b542a22.jpg","TwitterHandle":"JakobTheDev","WebsiteUrl":"https://medium.com/@jakob.pennington"}]},{"Id":"3bbde761-29c1-440e-8db3-2bbe3c8ee495","Title":"Turning great individuals into a great team","Abstract":"A great technology organisation starts with great people, but that is not enough. They need help to unite under a common vision, and a framework for deciding what to do, and what not to do. This presentation explains how to transform a group of smart, talented individuals into a high-performance team.\r\n\r\nJanuary 2017 I became the Chief Technology Officer of an online media and travel company and was immediately confronted by an impossible situation. The product team was being bombarded with initiatives to deliver, all of which needed to be delivered immediately. A team ten times the size could not have done it. The required set of initiatives changed on a weekly basis, compounding the problem. The product team had been doing their best to meet the demands of the organisation, thus they had accumulated a portfolio of poorly thought out, half-executed solutions\r\n\r\nThis presentation is about how to create a technology strategy, map the strategy to execution, and release successful products. It includes topics such as: the importance of having a technology strategy, how to work with your CEO or stakeholders to define a product strategy and prioritize initiatives, and how to manage a product delivery team to focus on creating value over being busy.","Format":"45 mins","Level":"Mostly advanced","Tags":["Soft Skills","Leadership","Teams"],"Presenters":[{"Id":"c549d21b-9715-4e10-ab67-610c878d286e","Name":"Liam McLennan","Tagline":"Principal Consultant, Readify","Bio":"Liam is a successful CTO, technology leader, engineering manager and agile product delivery expert. He helps organizations to develop effective technology strategy, then implement that strategy to achieve their objectives. Other major interests are optimizing the impact of software delivery and building cross-functional, high-performance teams. \r\n\r\nHe is currently a Principal Consultant for consulting company Readify. Previously, he was Chief Technology Officer of an online media and travel company with 300,000 members. ","ProfilePhotoUrl":"https://sessionize.com/image?f=5eb4dc955012aeb9c3fc9dcb1f84c278,400,400,1,0,b9-251f-4353-a020-f33b1ca205ab.b4fb9401-2ca5-47aa-8040-20a2f646b369.jpg","TwitterHandle":"liammclennan","WebsiteUrl":"https://withouttheloop.com/"}]},{"Id":"5c753bfe-95d3-40b1-899d-f27ef013236b","Title":"TypeScript: Beyond 101","Abstract":"Discovering TypeScript for most people is a mind-blowing experience.\r\n\r\nStrong typing, refactor-friendly codebases and a pleasant language that closes the gap between full-featured backend languages and Javascript.\r\n\r\nBut it's that all TypeScript has to offer? Definitely not!!\r\n\r\nTypeScript is much more than that and I will help you discover what those extra features are so that you can step-up your TypeScript skills to the next level.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Frontend Development","Programming Languages","Functional Programming"],"Presenters":[{"Id":"18de9781-0698-46bb-9e45-15efcf8cccfe","Name":"Jaime Febres","Tagline":"Senior Developer at Readify","Bio":"Hi, my name is Jaime (I know, tricky pronunciation!).\r\nI am a Software Developer based in sunny Brisbane, I have an awesome job at Readify where I help customers solve complex problems using the latest technologies.\r\nI have over 15 years of experience and I constantly keep looking for tech that gets me excited.\r\nWeb development is what passionates me, from the markup rendered on the screen all the way up to the server stack being used.\r\nI often jokingly call myself a Full *Snack* Developer :)","ProfilePhotoUrl":"https://sessionize.com/image?f=e5044e72d394f1bde0b31d87b5132381,400,400,1,0,753d6aee-6885-48d3-96ce-458756f02e20.jpg","TwitterHandle":"jaimefebres","WebsiteUrl":"https://blog.fullsnackdev.com/"}]},{"Id":"3aef4b8a-2a4f-4cb8-9f6d-8cad761e659f","Title":"What to do with our unconscious bias.","Abstract":"Upgrade your skills on how to identify your own unconscious bias, when to challenge it, how to communicate it and best deal with the environment that doesn't match your perfect world scenario.\r\n\r\nA journey into a critical and hysterical investigation of the speakers own personal unconscious bias across childhood experiences, education and careers.\r\n\r\nYou don’t need to be a manager help create safe space to question bias in your organisation.","Format":"45 mins","Level":"No experience necessary","Tags":["Soft Skills","Leadership","Machine Learning"],"Presenters":[{"Id":"17afa1cd-77c0-4d02-a7dc-9552305d2168","Name":"Ming Johanson","Tagline":"Mother of Unicorns","Bio":"Ming works with a number of businesses across the globe of varying sizes training in social media, shaping the landscape for leaders to adapt their management, sales and marketing culture so that it fits into the modern day world of hyper-connectivity.\r\n\r\nIn her spare time Ming is also an elected board member of the Western Australian Branch of the Australian Computer Society (ACS), a regular contributor and commentator for the Australian media in tech, a mentor at Startup Weekends in Perth and an Ambassador for in mental health for R U OK? Day.","ProfilePhotoUrl":"https://sessionize.com/image?f=3a07aef97883dbbdbec4353934a4263b,400,400,1,0,2b-89af-4b97-bd48-f8e8174eb9d1.8a088eb2-2cfc-4db8-be6d-991db8f6abe3.jpg","TwitterHandle":"http://twitter.com/MingJohanson","WebsiteUrl":"https://mingjohanson.com.au"}]},{"Id":"1d921838-42aa-47ce-b599-3e2ef23ff96f","Title":"Where did all the women go?","Abstract":"In the late 70's the software development industry was dominated by women, those jobs were seen as admin in nature. Things changed dramatically when the IT industry was commercialised. Where did all the women go and why do we need them more than ever?","Format":"45 mins","Level":"Mostly intermediate","Tags":["Soft Skills","Career","Teams"],"Presenters":[{"Id":"8fc8ebcd-c6d2-4443-ba1b-6234158d8af5","Name":"Elena Casciano","Tagline":"General Manager, Code 360","Bio":"With over 15 years of experience in large commercial businesses, Elena now heads up a local SA business delivering digital platforms for Australian universities to engage with students for better learning outcomes.","ProfilePhotoUrl":"https://sessionize.com/image?f=6084b24042c6224f38d9ed8db4a75bbe,400,400,1,0,fc-261e-46f9-9aa3-b4cc2bcba079.bb9574c4-c130-428b-bf5d-1466cd1fd53d.jpg","TwitterHandle":"elenacasciano83","WebsiteUrl":"https://www.linkedin.com/in/elenacasciano/"}]},{"Id":"187de1d4-070f-42b1-a3e6-2eb5f0d19d81","Title":"Working in a High-Frequency Organization","Abstract":"Senior leadership are continuously looking for ways to innovate and optimize their business.  Cloud computing has allowed levels of both innovation and optimization never seen before in our lifetime.  How do you keep up?  As a developer, what are some of the things you need to keep an eye out for when working in such an environment?  This session will look at the evolution of the IT organization, and how with cloud computing, engineers are having to move faster and faster with new technologies.  We’ll also look at organizational structure, and other aspects for of highly-dynamic engineering teams.  ","Format":"45 mins","Level":"No experience necessary","Tags":["Cloud","AWS","Teams"],"Presenters":[{"Id":"ea752647-5edf-43e1-932b-72a9bdaa0956","Name":"Matt Fitzgerald","Tagline":"Sr. Mgr. Technical Evangelism APJC (Amazon Web Services)","Bio":"Matt leads the Asia Pacific/Japan Technical Evangelist team  at Amazon Web Services. He’s a 25 year veteran of the IT industry and has had both individual contributor and management roles in field operations, support, software engineering, program management, education & certification and sales. Recently returned from 5-years working for Amazon in Seattle, his most recent endeavors saw him build and lead the team overseeing the Amazon.com migration to AWS and managing a software development team building a managed big-data platform for massive scale. His current role allows him to impart his knowledge with fellow developers and executives on the benefits of moving to the cloud.","ProfilePhotoUrl":"https://sessionize.com/image?f=dd38060ee5830cf8eb5aa5958f805685,400,400,1,0,8a182aa4-b174-4639-958c-97c623a0e754.jpg","TwitterHandle":"mattfitzee","WebsiteUrl":"https://www.linkedin.com/in/matt-fitzgerald-b7b4523/"}]}]